SkydiverMCU/mcu-iap-demo/Cortex-M0/MM32G0020/MM32G0020_Bootloader/Device/MM32G0020/Include/reg_rcc.h
/**
  * @brief RCC_CSR Register Bit Definition
  */
#define  RCC_CSR_LSION_Pos                        (0)
#define  RCC_CSR_LSION_Msk                        (0x1U << RCC_CSR_LSION_Pos)                       /*!<Internal Low-speed Oscillator Enable*/
#define  RCC_CSR_LSION                            RCC_CSR_LSION_Msk
#define  RCC_CSR_LSIRDY_Pos                       (1)
#define  RCC_CSR_LSIRDY_Msk                       (0x1U << RCC_CSR_LSIRDY_Pos)                      /*!<Internal Low-speed Oscillator Ready*/
#define  RCC_CSR_LSIRDY                           RCC_CSR_LSIRDY_Msk
#define  RCC_CSR_PVDRSTEN_Pos                     (6)
#define  RCC_CSR_PVDRSTEN_Msk                     (0x1U << RCC_CSR_PVDRSTEN_Pos)                    /*!<PVD Reset Enable*/
#define  RCC_CSR_PVDRSTEN                         RCC_CSR_PVDRSTEN_Msk
#define  RCC_CSR_LOCKUPEN_Pos                     (7)
#define  RCC_CSR_LOCKUPEN_Msk                     (0x1U << RCC_CSR_LOCKUPEN_Pos)                    /*!<CPU Lockup Reset Enable*/
#define  RCC_CSR_LOCKUPEN                         RCC_CSR_LOCKUPEN_Msk
#define  RCC_CSR_PVDRSTF_Pos                      (22)
#define  RCC_CSR_PVDRSTF_Msk                      (0x1U << RCC_CSR_PVDRSTF_Pos)                     /*!<PVD Reset Flag*/
#define  RCC_CSR_PVDRSTF                          RCC_CSR_PVDRSTF_Msk
#define  RCC_CSR_LOCKUPF_Pos                      (23)
#define  RCC_CSR_LOCKUPF_Msk                      (0x1U << RCC_CSR_LOCKUPF_Pos)                     /*!<CPU Lockup Reset Flag*/
#define  RCC_CSR_LOCKUPF                          RCC_CSR_LOCKUPF_Msk
#define  RCC_CSR_RMVF_Pos                         (24)
#define  RCC_CSR_RMVF_Msk                         (0x1U << RCC_CSR_RMVF_Pos)                        /*!<Remove Reset Flag*/
#define  RCC_CSR_RMVF                             RCC_CSR_RMVF_Msk
#define  RCC_CSR_PINRSTF_Pos                      (26)
#define  RCC_CSR_PINRSTF_Msk                      (0x1U << RCC_CSR_PINRSTF_Pos)                     /*!<PIN Reset Flag*/
#define  RCC_CSR_PINRSTF                          RCC_CSR_PINRSTF_Msk
#define  RCC_CSR_PORRSTF_Pos                      (27)
#define  RCC_CSR_PORRSTF_Msk                      (0x1U << RCC_CSR_PORRSTF_Pos)                     /*!<POR/PDR Reset Flag*/
#define  RCC_CSR_PORRSTF                          RCC_CSR_PORRSTF_Msk
#define  RCC_CSR_SFTRSTF_Pos                      (28)
#define  RCC_CSR_SFTRSTF_Msk                      (0x1U << RCC_CSR_SFTRSTF_Pos)                     /*!<Software Reset Flag*/
#define  RCC_CSR_SFTRSTF                          RCC_CSR_SFTRSTF_Msk
#define  RCC_CSR_IWDGRSTF_Pos                     (29)
#define  RCC_CSR_IWDGRSTF_Msk                     (0x1U << RCC_CSR_IWDGRSTF_Pos)                    /*!<Independent Watchdog Reset Flag*/
#define  RCC_CSR_IWDGRSTF                         RCC_CSR_IWDGRSTF_Msk
#define  RCC_CSR_LPWRRSTF_Pos                     (31)
#define  RCC_CSR_LPWRRSTF_Msk                     (0x1U << RCC_CSR_LPWRRSTF_Pos)                    /*!<Low power reset flag*/
#define  RCC_CSR_LPWRRSTF                         RCC_CSR_LPWRRSTF_Msk

/**
  * @brief RCC_AHBRSTR Register Bit Definition
  */
#define  RCC_AHBRSTR_CRC_Pos                      (6)
#define  RCC_AHBRSTR_CRC_Msk                      (0x1U << RCC_AHBRSTR_CRC_Pos)                     /*!<CRC Reset*/
#define  RCC_AHBRSTR_CRC                          RCC_AHBRSTR_CRC_Msk
#define  RCC_AHBRSTR_GPIOA_Pos                    (17)
#define  RCC_AHBRSTR_GPIOA_Msk                    (0x1U << RCC_AHBRSTR_GPIOA_Pos)                   /*!<GPIOA Reset*/
#define  RCC_AHBRSTR_GPIOA                        RCC_AHBRSTR_GPIOA_Msk
#define  RCC_AHBRSTR_GPIOB_Pos                    (18)
#define  RCC_AHBRSTR_GPIOB_Msk                    (0x1U << RCC_AHBRSTR_GPIOB_Pos)                   /*!<GPIOB Reset*/
#define  RCC_AHBRSTR_GPIOB                        RCC_AHBRSTR_GPIOB_Msk

/**
  * @brief RCC_CFGR2 Register Bit Definition
  */
#define  RCC_CFGR2_MCOPRE_Pos                     (20)
#define  RCC_CFGR2_MCOPRE_Msk                     (0xFU << RCC_CFGR2_MCOPRE_Pos)                    /*!<MCO clock prescaler factor*/
#define  RCC_CFGR2_MCOPRE                         RCC_CFGR2_MCOPRE_Msk
#define  RCC_CFGR2_MCOPRE_0                       (0x1U << RCC_CFGR2_MCOPRE_Pos) 
#define  RCC_CFGR2_MCOPRE_1                       (0x2U << RCC_CFGR2_MCOPRE_Pos) 
#define  RCC_CFGR2_MCOPRE_2                       (0x4U << RCC_CFGR2_MCOPRE_Pos) 
#define  RCC_CFGR2_MCOPRE_3                       (0x8U << RCC_CFGR2_MCOPRE_Pos) 

/**
  * @brief RCC_SYSCFG Register Bit Definition
  */
#define  RCC_SYSCFG_PROG_CHECK_EN_Pos             (0)
#define  RCC_SYSCFG_PROG_CHECK_EN_Msk             (0x1U << RCC_SYSCFG_PROG_CHECK_EN_Pos)            /*!<Check whether the data in Flash is 0xFF when writing Flash*/
#define  RCC_SYSCFG_PROG_CHECK_EN                 RCC_SYSCFG_PROG_CHECK_EN_Msk
#define  RCC_SYSCFG_HSE_RFB_SEL_Pos               (8)
#define  RCC_SYSCFG_HSE_RFB_SEL_Msk               (0x3U << RCC_SYSCFG_HSE_RFB_SEL_Pos)              /*!<Feedback resistor selection.*/
#define  RCC_SYSCFG_HSE_RFB_SEL                   RCC_SYSCFG_HSE_RFB_SEL_Msk
#define  RCC_SYSCFG_HSE_RFB_SEL_0                 (0x1U << RCC_SYSCFG_HSE_RFB_SEL_Pos) 
#define  RCC_SYSCFG_HSE_RFB_SEL_1                 (0x2U << RCC_SYSCFG_HSE_RFB_SEL_Pos) 
#define  RCC_SYSCFG_HSELPFEN_Pos                  (14)
#define  RCC_SYSCFG_HSELPFEN_Msk                  (0x1U << RCC_SYSCFG_HSELPFEN_Pos)                 /*!<External crystal low-pass filter enable*/
#define  RCC_SYSCFG_HSELPFEN                      RCC_SYSCFG_HSELPFEN_Msk

/**
  * @brief RCC_PLLCFGR Register Bit Definition
  */
#define  RCC_PLLCFGR_PLLSRC_Pos                   (0)
#define  RCC_PLLCFGR_PLLSRC_Msk                   (0x1U << RCC_PLLCFGR_PLLSRC_Pos)                  /*!<PLL input clock source selection*/
#define  RCC_PLLCFGR_PLLSRC                       RCC_PLLCFGR_PLLSRC_Msk
#define  RCC_PLLCFGR_PLLXTPRE_Pos                 (1)
#define  RCC_PLLCFGR_PLLXTPRE_Msk                 (0x1U << RCC_PLLCFGR_PLLXTPRE_Pos)                /*!<Division selection when HSE clock is used as PLL input*/
#define  RCC_PLLCFGR_PLLXTPRE                     RCC_PLLCFGR_PLLXTPRE_Msk
#define  RCC_PLLCFGR_PLL_ICTRL_Pos                (2)
#define  RCC_PLLCFGR_PLL_ICTRL_Msk                (0x3U << RCC_PLLCFGR_PLL_ICTRL_Pos)               /*!<PLL CP current control signal*/
#define  RCC_PLLCFGR_PLL_ICTRL                    RCC_PLLCFGR_PLL_ICTRL_Msk
#define  RCC_PLLCFGR_PLL_ICTRL_0                  (0x1U << RCC_PLLCFGR_PLL_ICTRL_Pos) 
#define  RCC_PLLCFGR_PLL_ICTRL_1                  (0x2U << RCC_PLLCFGR_PLL_ICTRL_Pos) 
#define  RCC_PLLCFGR_PLL_LDS_Pos                  (4)
#define  RCC_PLLCFGR_PLL_LDS_Msk                  (0x3U << RCC_PLLCFGR_PLL_LDS_Pos)                 /*!<PLL lock detector accuracy selection*/
#define  RCC_PLLCFGR_PLL_LDS                      RCC_PLLCFGR_PLL_LDS_Msk
#define  RCC_PLLCFGR_PLL_LDS_0                    (0x1U << RCC_PLLCFGR_PLL_LDS_Pos) 
#define  RCC_PLLCFGR_PLL_LDS_1                    (0x2U << RCC_PLLCFGR_PLL_LDS_Pos) 
#define  RCC_PLLCFGR_PLLDIV_Pos                   (8)
#define  RCC_PLLCFGR_PLLDIV_Msk                   (0x7U << RCC_PLLCFGR_PLLDIV_Pos)                  /*!<PLL divide factor*/
#define  RCC_PLLCFGR_PLLDIV                       RCC_PLLCFGR_PLLDIV_Msk
#define  RCC_PLLCFGR_PLLDIV_0                     (0x1U << RCC_PLLCFGR_PLLDIV_Pos) 
#define  RCC_PLLCFGR_PLLDIV_1                     (0x2U << RCC_PLLCFGR_PLLDIV_Pos) 
#define  RCC_PLLCFGR_PLLDIV_2                     (0x4U << RCC_PLLCFGR_PLLDIV_Pos) 
#define  RCC_PLLCFGR_PLLMUL_Pos                   (16)
#define  RCC_PLLCFGR_PLLMUL_Msk                   (0xFFU << RCC_PLLCFGR_PLLMUL_Pos)                 /*!<PLL Multiplication Factor*/
#define  RCC_PLLCFGR_PLLMUL                       RCC_PLLCFGR_PLLMUL_Msk
#define  RCC_PLLCFGR_PLLMUL_0                     (0x01U << RCC_PLLCFGR_PLLMUL_Pos) 
#define  RCC_PLLCFGR_PLLMUL_1                     (0x02U << RCC_PLLCFGR_PLLMUL_Pos) 
#define  RCC_PLLCFGR_PLLMUL_2                     (0x04U << RCC_PLLCFGR_PLLMUL_Pos) 
#define  RCC_PLLCFGR_PLLMUL_3                     (0x08U << RCC_PLLCFGR_PLLMUL_Pos) 
#define  RCC_PLLCFGR_PLLMUL_4                     (0x10U << RCC_PLLCFGR_PLLMUL_Pos) 
#define  RCC_PLLCFGR_PLLMUL_5                     (0x20U << RCC_PLLCFGR_PLLMUL_Pos) 
#define  RCC_PLLCFGR_PLLMUL_6                     (0x40U << RCC_PLLCFGR_PLLMUL_Pos) 
#define  RCC_PLLCFGR_PLLMUL_7                     (0x80U << RCC_PLLCFGR_PLLMUL_Pos) 
#define  RCC_PLLCFGR_PLLPDIV_Pos                  (29)
#define  RCC_PLLCFGR_PLLPDIV_Msk                  (0x7U << RCC_PLLCFGR_PLLPDIV_Pos)                 /*!<PLL Pre-divide Factor*/
#define  RCC_PLLCFGR_PLLPDIV                      RCC_PLLCFGR_PLLPDIV_Msk
#define  RCC_PLLCFGR_PLLPDIV_0                    (0x1U << RCC_PLLCFGR_PLLPDIV_Pos) 
#define  RCC_PLLCFGR_PLLPDIV_1                    (0x2U << RCC_PLLCFGR_PLLPDIV_Pos) 
#define  RCC_PLLCFGR_PLLPDIV_2                    (0x4U << RCC_PLLCFGR_PLLPDIV_Pos) 

/** ------------------------------------------------------------------------------------------------------------------*/
#endif
/** ------------------------------------------------------------------------------------------------------------------*/
